# parameters
nc: 80  # number of classes
depth_multiple: 1.0  # model depth multiple
width_multiple: 1.0  # layer channel multiple

# anchors
anchors:
  - [12,16, 19,36, 40,28]  # P3/8
  - [36,75, 76,55, 72,146]  # P4/16
  - [142,110, 192,243, 459,401]  # P5/32

# yolov7 backbone
backbone:
  # [from, number, module, args]

  #two stream
  [
    
    # stream one
   [-1, 1, Conv, [32, 3, 1]],  # 0
  
   [-1, 1, Conv, [64, 3, 2]],  # 1-P1/2      
   [-1, 1, Conv, [64, 3, 1]],
   
   [-1, 1, Conv, [128, 3, 2]],  # 3-P2/4  
   [-1, 1, Conv, [64, 1, 1]],
   [-2, 1, Conv, [64, 1, 1]],
   [-1, 1, Conv, [64, 3, 1]],
   [-1, 1, Conv, [64, 3, 1]],
   [-1, 1, Conv, [64, 3, 1]],
   [-1, 1, Conv, [64, 3, 1]],
   [[-1, -3, -5, -6], 1, Concat, [1]],
   [-1, 1, Conv, [256, 1, 1]],  # 11
   [-1, 1, MP, []],
   [-1, 1, Conv, [128, 1, 1]],
   [-3, 1, Conv, [128, 1, 1]],
   [-1, 1, Conv, [128, 3, 2]],
   [[-1, -3], 1, Concat, [1]],  # 16-P3/8  
   [-1, 1, Conv, [128, 1, 1]],
   [-2, 1, Conv, [128, 1, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [[-1, -3, -5, -6], 1, Concat, [1]],
   [-1, 1, Conv, [512, 1, 1]],  # 24 [1, 512, 80, 80]


    # stream two
   [-26, 1, Conv1, [32, 3, 1]],  # 25
  
   [-1, 1, Conv, [64, 3, 2]],  # 26-P1/2      
   [-1, 1, Conv, [64, 3, 1]],
   
   [-1, 1, Conv, [128, 3, 2]],  # 28-P2/4  
   [-1, 1, Conv, [64, 1, 1]],
   [-2, 1, Conv, [64, 1, 1]],
   [-1, 1, Conv, [64, 3, 1]],
   [-1, 1, Conv, [64, 3, 1]],
   [-1, 1, Conv, [64, 3, 1]],
   [-1, 1, Conv, [64, 3, 1]],
   [[-1, -3, -5, -6], 1, Concat, [1]],
   [-1, 1, Conv, [256, 1, 1]],  # 36 
   [-1, 1, MP, []],
   [-1, 1, Conv, [128, 1, 1]],
   [-3, 1, Conv, [128, 1, 1]],
   [-1, 1, Conv, [128, 3, 2]],
   [[-1, -3], 1, Concat, [1]],  # 41-P3/8  
   [-1, 1, Conv, [128, 1, 1]],
   [-2, 1, Conv, [128, 1, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [[-1, -3, -5, -6], 1, Concat, [1]],
   [-1, 1, Conv, [512, 1, 1]],  # 49 [1, 512, 80, 80]



    ######### TransformerBlock #############
   [[24,49], 1, GPT, [512]],   # 50 [1, 512, 80, 80]
   [[24,50], 1, Add2, [512,0]],    # 51 stream one x+trans[0]
   [[49,50], 1, Add2, [512,1]],    # 52 stream two x+trans[1]  



  # stream one
   [51, 1, MP, []], # 53
   [-1, 1, Conv, [256, 1, 1]], # [1, 256, 16, 16] [1, 256, 40, 40]
   [51, 1, Conv, [256, 1, 1]], # [1, 256, 32, 32] [1, 256, 80, 80]
   [-1, 1, Conv, [256, 3, 2]], # [1, 256, 16, 16] [1, 256, 40, 40]
   [[-1, -3], 1, Concat, [1]],  # 57-P4/16  
   [-1, 1, Conv, [256, 1, 1]],
   [-2, 1, Conv, [256, 1, 1]],
   [-1, 1, Conv, [256, 3, 1]],
   [-1, 1, Conv, [256, 3, 1]],
   [-1, 1, Conv, [256, 3, 1]],
   [-1, 1, Conv, [256, 3, 1]],
   [[-1, -3, -5, -6], 1, Concat, [1]],
   [-1, 1, Conv, [1024, 1, 1]],  # 65


  # stream two
   [52, 1, MP, []], # 66  
   [-1, 1, Conv, [256, 1, 1]], #[1, 256, 16, 16] [1, 256, 40, 40]
   [52, 1, Conv, [256, 1, 1]], #[1, 256, 32, 32] [1, 256, 80, 80]
   [-1, 1, Conv, [256, 3, 2]], #[1, 256, 16, 16] [1, 256, 40, 40]
   [[-1, -3], 1, Concat, [1]],  # 70-P4/16  
   [-1, 1, Conv, [256, 1, 1]],
   [-2, 1, Conv, [256, 1, 1]],
   [-1, 1, Conv, [256, 3, 1]],
   [-1, 1, Conv, [256, 3, 1]],
   [-1, 1, Conv, [256, 3, 1]],
   [-1, 1, Conv, [256, 3, 1]],
   [[-1, -3, -5, -6], 1, Concat, [1]],
   [-1, 1, Conv, [1024, 1, 1]],  # 78

  ######### TransformerBlock #############
   [[65,78], 1, GPT, [1024]],   # 79 [1, 1024, 40, 40]
   [[65,79], 1, Add2, [1024,0]],    # 80 stream one x+trans[0]
   [[78,79], 1, Add2, [1024,1]],    # 81 stream two x+trans[1]  



  # stream one
   [80, 1, MP, []], # 82
   [-1, 1, Conv, [512, 1, 1]],
   [80, 1, Conv, [512, 1, 1]],
   [-1, 1, Conv, [512, 3, 2]],
   [[-1, -3], 1, Concat, [1]],  # 86-P5/32  
   [-1, 1, Conv, [256, 1, 1]],
   [-2, 1, Conv, [256, 1, 1]],
   [-1, 1, Conv, [256, 3, 1]],
   [-1, 1, Conv, [256, 3, 1]],
   [-1, 1, Conv, [256, 3, 1]],
   [-1, 1, Conv, [256, 3, 1]],
   [[-1, -3, -5, -6], 1, Concat, [1]],
   [-1, 1, Conv, [1024, 1, 1]],  # 94    ([1, 1024, 20, 20])


  # stream two 
   [81, 1, MP, []], # 95
   [-1, 1, Conv, [512, 1, 1]],
   [81, 1, Conv, [512, 1, 1]],
   [-1, 1, Conv, [512, 3, 2]],
   [[-1, -3], 1, Concat, [1]],  # 99-P5/32  
   [-1, 1, Conv, [256, 1, 1]],
   [-2, 1, Conv, [256, 1, 1]],
   [-1, 1, Conv, [256, 3, 1]],
   [-1, 1, Conv, [256, 3, 1]],
   [-1, 1, Conv, [256, 3, 1]],
   [-1, 1, Conv, [256, 3, 1]],
   [[-1, -3, -5, -6], 1, Concat, [1]],
   [-1, 1, Conv, [1024, 1, 1]],  # 107    ([1, 1024, 20, 20])

  ######### TransformerBlock #############
   [[94,107], 1, GPT, [1024]],   # 108 [1, 1024, 20, 20]
   [[94,108], 1, Add2, [1024,0]],    # 109 stream one x+trans[0]
   [[107,108], 1, Add2, [1024,1]],    # 110 stream two x+trans[1]  


   ######### Add Block #############
    [[51,52], 1, Add, [1]],   # 111 [80,80,512] [1, 512, 32, 32]
    [[80,81], 1, Add, [1]],   # 112 [40,40,1024] [1, 1024, 16, 16]
    [[109,110], 1, Add, [1]],   # 113 [20,20,1024] [1, 1024, 16, 16]

  ]

# yolov7 head
head:
  [[-1, 1, SPPCSPC, [512]], # 114 [512,16,16]
  
   [-1, 1, Conv, [256, 1, 1]], # [256, 16, 16]
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [112, 1, Conv, [256, 1, 1]], # route backbone P4  [256,40,40] [256, 16, 16]
   [[-1, -2], 1, Concat, [1]],
   
   [-1, 1, Conv, [256, 1, 1]],
   [-2, 1, Conv, [256, 1, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [[-1, -2, -3, -4, -5, -6], 1, Concat, [1]],
   [-1, 1, Conv, [256, 1, 1]], # 126
   
   [-1, 1, Conv, [128, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [111, 1, Conv, [128, 1, 1]], # route backbone P3 [128,80,80]
   [[-1, -2], 1, Concat, [1]],
   
   [-1, 1, Conv, [128, 1, 1]],
   [-2, 1, Conv, [128, 1, 1]],
   [-1, 1, Conv, [64, 3, 1]],
   [-1, 1, Conv, [64, 3, 1]],
   [-1, 1, Conv, [64, 3, 1]],
   [-1, 1, Conv, [64, 3, 1]],
   [[-1, -2, -3, -4, -5, -6], 1, Concat, [1]],
   [-1, 1, Conv, [128, 1, 1]], # 138 [b, 128, 80, 80]
      
   [-1, 1, MP, []],
   [-1, 1, Conv, [128, 1, 1]],
   [-3, 1, Conv, [128, 1, 1]],
   [-1, 1, Conv, [128, 3, 2]],
   [[-1, -3, 126], 1, Concat, [1]],
   
   [-1, 1, Conv, [256, 1, 1]],
   [-2, 1, Conv, [256, 1, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [[-1, -2, -3, -4, -5, -6], 1, Concat, [1]],
   [-1, 1, Conv, [256, 1, 1]], # 151 [b, 256, 40, 40]
      
   [-1, 1, MP, []], # [b, 256, 20, 20]
   [-1, 1, Conv, [256, 1, 1]],
   [-3, 1, Conv, [256, 1, 1]],
   [-1, 1, Conv, [256, 3, 2]],
   [[-1, -3, 114], 1, Concat, [1]],
   
   [-1, 1, Conv, [512, 1, 1]],
   [-2, 1, Conv, [512, 1, 1]],
   [-1, 1, Conv, [256, 3, 1]],
   [-1, 1, Conv, [256, 3, 1]],
   [-1, 1, Conv, [256, 3, 1]],
   [-1, 1, Conv, [256, 3, 1]],
   [[-1, -2, -3, -4, -5, -6], 1, Concat, [1]],
   [-1, 1, Conv, [512, 1, 1]], # 164 [b, 512, 20, 20]
   
   [138, 1, RepConv, [256, 3, 1]],
   [151, 1, RepConv, [512, 3, 1]],
   [164, 1, RepConv, [1024, 3, 1]],

   [[165,166,167], 1, IDetect, [nc, anchors]],   # Detect(P3, P4, P5)
  ]
